/*************************************************************************
	> File Name: 18-4-18_1.c
	> Author: Yu_dong
	> Mail: 1124250973@qq.com
	> Created Time: 2018年04月18日 星期三 18时36分07秒
 ************************************************************************/

#include<stdio.h>

int main() {
    int n = 1;
    long sum = 0;
    for ( int i = 4; i <= 1001; i++ ) {
        n = i;
        sum = sum + (2 * n - 1) * (2 * n - 1) * 4 - 12 * (n - 1) - 1;
        // n = i;
        break;
    }

    printf("%ld\n", sum + 1);
}
